# Ejercicios de Pandas - Nivel Inicial

## Ejercicio 1: Creaci√≥n y manipulaci√≥n de Series
1. Crea una Serie a partir del diccionario {'Matem√°ticas': 9, 'Historia': 7.5, 'F√≠sica': 8.2}
2. Accede a la nota de 'Historia' usando la notaci√≥n de corchetes
3. Crea otra Serie con las mismas materias pero diferentes notas y suma ambas Series

In [1]:
import numpy as np
import pandas as pd

In [ ]:
#1. Crea una Serie a partir del diccionario {'Matem√°ticas': 9, 'Historia': 7.5, 'F√≠sica': 8.2}
notas_1 = pd.Series({'Matem√°ticas': 9, 'Historia': 7.5, 'F√≠sica': 8.2})

In [3]:
print("Serie 1:\n", notas_1)

Serie 1:
 Matem√°ticas    9.0
Historia       7.5
F√≠sica         8.2
dtype: float64

In [ ]:
#2. Accede a la nota de 'Historia' usando la notaci√≥n de corchetes
nota_historia = notas_1['Historia']

In [5]:
print("\nNota de Historia:", nota_historia)

Nota de Historia: 7.5

In [7]:
#3. Crea otra Serie con las mismas materias pero diferentes notas y suma ambas Series
notas_2 = pd.Series({'Matem√°ticas': 8, 'Historia': 6.2, 'F√≠sica': 7.3})

In [8]:
print("Serie 2:\n", notas_1)

Serie 2:
 Matem√°ticas    9.0
Historia       7.5
F√≠sica         8.2
dtype: float64

In [11]:
suma_notas = notas_1 + notas_2

In [13]:
print("Serie notas1:\n", notas_1) 
print()
print("Serie notas2:\n", notas_2)
print()
print("Suma notas:\n", suma_notas)

Serie notas1:
 Matem√°ticas    9.0
Historia       7.5
F√≠sica         8.2
dtype: float64

Serie notas2:
 Matem√°ticas    8.0
Historia       6.2
F√≠sica         7.3
dtype: float64

Suma notas:
 Matem√°ticas    17.0
Historia       13.7
F√≠sica         15.5
dtype: float64

## Ejercicio 2: Operaciones b√°sicas con DataFrames
Dado el siguiente DataFrame:

In [70]:
df = pd.DataFrame({
    'Producto': ['Manzana', 'Pera', 'Pl√°tano'],
    'Precio': [1.2, 1.5, 0.8],
    'Stock': [45, 32, 67]
})

In [15]:
df

  Producto  Precio  Stock
0  Manzana     1.2     45
1     Pera     1.5     32
2  Pl√°tano     0.8     67


1. Muestra solo la columna 'Precio'
2. Filtra los productos con precio mayor a 1.0
3. A√±ade una nueva columna 'Valor_total' que sea Precio * Stock

In [24]:
#1. Muestra solo la columna 'Precio'
df['Precio']

0    1.2
1    1.5
2    0.8
Name: Precio, dtype: float64

In [25]:
#2. Filtra los productos con precio mayor a 1.0
df[df['Precio'] > 1.0]

  Producto  Precio  Stock
0  Manzana     1.2     45
1     Pera     1.5     32

In [71]:
#3. A√±ade una nueva columna 'Valor_total' que sea Precio * Stock
df['Valor_total'] = df['Precio'] * df['Stock']

In [72]:
df

  Producto  Precio  Stock  Valor_total
0  Manzana     1.2     45         54.0
1     Pera     1.5     32         48.0
2  Pl√°tano     0.8     67         53.6

## Ejercicio 3: Selecci√≥n de datos
Usando el DataFrame del ejercicio 2:
1. Selecciona la fila del 'Pl√°tano' usando loc
2. Selecciona el precio de la 'Pera' usando iloc
3. Muestra solo las columnas 'Producto' y 'Stock' para todos los productos

In [73]:
#1. Selecciona la fila del 'Pl√°tano' usando loc

df.loc[df['Producto'] == 'Pl√°tano']

  Producto  Precio  Stock  Valor_total
2  Pl√°tano     0.8     67         53.6

In [74]:
# 2. Selecciona el precio de la 'Pera' usando iloc
df.iloc[1]['Precio']

1.5

In [35]:
#3. Muestra solo las columnas 'Producto' y 'Stock' para todos los productos
productos_stock = df[['Producto', 'Stock']]
print("\nProductos y Stock:\n", productos_stock)

Productos y Stock:
   Producto  Stock
0  Manzana     45
1     Pera     32
2  Pl√°tano     67

## Ejercicio 4: Valores faltantes
Dado este DataFrame:

In [75]:
df=pd.DataFrame({
'A':[1,np.nan,3,4],
'B':[5,6,np.nan,8],
'C':[9,10,11,12]
})

In [76]:
df

     A    B   C
0  1.0  5.0   9
1  NaN  6.0  10
2  3.0  NaN  11
3  4.0  8.0  12

1. Elimina las filas que contengan alg√∫n NaN
2. Rellena los NaN de la columna 'A' con su valor medio
3. Rellena los NaN de la columna 'B' con el valor m√°ximo de esa columna

In [77]:
#1. Elimina las filas que contengan alg√∫n NaN
df.dropna()

     A    B   C
0  1.0  5.0   9
3  4.0  8.0  12

In [ ]:
#3. Rellena los NaN de la columna 'A' con su valor medio
df['A'] = df['A'].fillna(df['A'].mean())

          A    B   C
0  1.000000  5.0   9
1  2.666667  6.0  10
2  3.000000  NaN  11
3  4.000000  8.0  12

In [ ]:
#3. Rellena los NaN de la columna 'B' con el valor m√°ximo de esa columna

df['B'] = df['B'].fillna(df['B'].max())

          A    B   C
0  1.000000  5.0   9
1  2.666667  6.0  10
2  3.000000  8.0  11
3  4.000000  8.0  12

In [47]:
df

          A    B   C
0  1.000000  5.0   9
1  2.666667  6.0  10
2  3.000000  8.0  11
3  4.000000  8.0  12

## Ejercicio 5: √çndices
1. Crea un DataFrame con datos aleatorios (3x3) y los √≠ndices ['X', 'Y', 'Z']
2. Resetea el √≠ndice y muestra el resultado
3. Vuelve a establecer la columna de √≠ndice como √≠ndice principal

In [48]:
#1. Crea un DataFrame con datos aleatorios (3x3) y los √≠ndices ['X', 'Y', 'Z']
datos_aleatorios = np.random.rand(3, 3)
df_aleatorio = pd.DataFrame(datos_aleatorios, index=['X', 'Y', 'Z'], columns=['A', 'B', 'C'])
print("\nDataFrame aleatorio:\n", df_aleatorio)

DataFrame aleatorio:
           A         B         C
X  0.367406  0.055261  0.304115
Y  0.047365  0.932662  0.641097
Z  0.856042  0.342571  0.611421

In [49]:
#2. Resetea el √≠ndice y muestra el resultado
df_aleatorio_reset = df_aleatorio.reset_index()
print("\nDataFrame con √≠ndice reseteado:\n", df_aleatorio_reset)

DataFrame con √≠ndice reseteado:
   index         A         B         C
0     X  0.367406  0.055261  0.304115
1     Y  0.047365  0.932662  0.641097
2     Z  0.856042  0.342571  0.611421

In [51]:
#3. Vuelve a establecer la columna de √≠ndice como √≠ndice principal
df_aleatorio_final = df_aleatorio_reset.set_index('index')
print("\nDataFrame con √≠ndice principal restablecido:\n", df_aleatorio_final)

DataFrame con √≠ndice principal restablecido:
               A         B         C
index
X      0.367406  0.055261  0.304115
Y      0.047365  0.932662  0.641097
Z      0.856042  0.342571  0.611421

## Ejercicio 6: Filtrado condicional
Dado este DataFrame

In [57]:
datos = {
    'Nombre': ['Ana', 'Juan', 'Sof√≠a', 'Carlos'],
    'Edad': [25, 32, 28, 40],
    'Ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Valencia']
}
df_personas = pd.DataFrame(datos)

In [58]:
print("\nDataFrame de personas:\n", df_personas)

DataFrame de personas:
    Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    32  Barcelona
2   Sof√≠a    28     Madrid
3  Carlos    40   Valencia

1. Filtra las personas que viven en 'Madrid'
2. Muestra los nombres de las personas mayores de 30 a√±os
3. Crea un filtro combinado: personas de Madrid mayores de 26 a√±os

In [84]:
#1. Filtra las personas que viven en 'Madrid'
madrid_personas = df_personas[df_personas['Ciudad'] == 'Madrid']
print(df_personas)
print("\nPersonas que viven en Madrid:\n", madrid_personas)

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    32  Barcelona
2   Sof√≠a    28     Madrid
3  Carlos    40   Valencia

Personas que viven en Madrid:
   Nombre  Edad  Ciudad
0    Ana    25  Madrid
2  Sof√≠a    28  Madrid

In [82]:
#2. Muestra los nombres de las personas mayores de 30 a√±os
ano_mayores_30 = df_personas[df_personas['Edad'] > 30][['Nombre', 'Edad']]
print(df_personas)
print("\nNombres de personas mayores de 30 a√±os:\n", ano_mayores_30)

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    32  Barcelona
2   Sof√≠a    28     Madrid
3  Carlos    40   Valencia

Nombres de personas mayores de 30 a√±os:
    Nombre  Edad
1    Juan    32
3  Carlos    40

In [83]:
#3. Crea un filtro combinado: personas de Madrid mayores de 26 a√±os
filtro_madrid_mayores_26 = df_personas[(df_personas['Ciudad'] == 'Madrid') & (df_personas['Edad'] > 26)]
print(df_personas)
print("\nPersonas de Madrid mayores de 26 a√±os:\n", filtro_madrid_mayores_26)

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Juan    32  Barcelona
2   Sof√≠a    28     Madrid
3  Carlos    40   Valencia

Personas de Madrid mayores de 26 a√±os:
   Nombre  Edad  Ciudad
2  Sof√≠a    28  Madrid

        Excelente pregunta. Vamos a aclararlo bien porque es clave en el manejo de pandas.

        üîç Diferencia entre ambos casos
        ‚úÖ Caso 1: ano_mayores_30 = df_personas[df_personas['Edad'] > 30][['Nombre', 'Edad']]
        Aqu√≠ est√°s filtrando filas y luego seleccionando solo dos columnas (Nombre y Edad).

        df_personas['Edad'] > 30 ‚Üí crea una condici√≥n booleana para filtrar filas.

        [...] al final con [['Nombre', 'Edad']] ‚Üí seleccionas columnas espec√≠ficas.

        üîÅ Resultado: un DataFrame m√°s peque√±o con solo esas columnas.

        ‚úÖ Caso 2: 
        filtro_madrid_mayores_26 = df_personas[(df_personas['Ciudad'] == 'Madrid') & (df_personas['Edad'] > 26)]
        Aqu√≠ est√°s haciendo solo un filtro de filas, sin limitar columnas, por eso te devuelve todas las columnas del DataFrame.

        üß† Conclusi√≥n:
        Ejemplo	                               ¬øFiltra filas?	¬øFiltra columnas?	Resultado
        caso 1 df[condici√≥n][['col1', 'col2']]	‚úÖ S√≠	        ‚úÖ S√≠	         Sub-DataFrame con solo ciertas columnas
        caso 2 df[condici√≥n]	                ‚úÖ S√≠	        ‚ùå No	         Todas las columnas de las filas que cumplen